---
type: FieldBuilder
namespace: Autodesk.Revit.DB.ExtensibleStorage
version: 2024
members: 9
tags: [revit-api, class]
---

# FieldBuilder

`Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FieldBuilder | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | NeedsSubSchemaGUID | 2012 | `public bool NeedsSubSchemaGUID ()` |
| Method | NeedsUnits | 2012 | `public bool NeedsUnits ()` |
| Method | Ready | 2012 | `public bool Ready ()` |
| Method | SetDocumentation | 2012 | `public FieldBuilder SetDocumentation ( string documentation )` |
| Method | SetSpec | 2012 | `public FieldBuilder SetSpec ( ForgeTypeId specTypeId )` |
| Method | SetSubSchemaGUID | 2012 | `public FieldBuilder SetSubSchemaGUID ( Guid guid )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |